       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyCelebrator.
       PROCEDURE DIVISION.
           DISPLAY "I'm alright though, it's pretty cool this COBOL" 
           "stuff isn't it. I'm not sure what the weather is going to"
            "be like tomorrow though?".
           

       
